//Напишите программу, считающую степени двойки до тех пор, пока целое не переполнится и число станет отрицательным. Вывести число и его степень.
#include <stdio.h>

int main(){
  int n, x;
  x = 1;
  n = 0;
  for (n = 0; x > 0; n++) x = x * 2;
  printf("x = %d, степень данного числа равна %d\n", x, n);
  return 0;
}
